posts/2015-12-29-buechner-on-compassion.org
#+date: <2015-12-29>
#+filetags: quotes
#+title: Buechner on Compassion

#+ATTR_HTML: :class bigquote
#+begin_quote
Compassion is sometimes the fatal capacity for feeling what it is like to live inside somebody else's skin. It is the knowledge that there can never really be any peace and joy for me until there is peace and joy finally for you too.
#+end_quote

#+ATTR_HTML: :class bigquote
Frederick Buechner




#+begin_tagline
Tagged: quotes
#+end_tagline
